t21/Walnut_X/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.2.0.pdsc
        <!-- *************************  Device 'EFM32ZG110F16'  ***************************** -->
        <device Dname="EFM32ZG110F16">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG110F16"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG110F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents/EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG110F32'  ***************************** -->
        <device Dname="EFM32ZG110F32">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG110F32"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG110F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents/EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG110F4'  ***************************** -->
        <device Dname="EFM32ZG110F4">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG110F4"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG110F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents/EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG110F8'  ***************************** -->
        <device Dname="EFM32ZG110F8">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG110F8"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG110F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents/EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32ZG210'  **************************** -->
      <subFamily DsubFamily="EFM32ZG210">
        <feature type="IOs"           n="24"                          name="General Purpose I/O pins"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>

        <!-- *************************  Device 'EFM32ZG210F16'  ***************************** -->
        <device Dname="EFM32ZG210F16">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG210F16"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG210F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents/EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG210F32'  ***************************** -->
        <device Dname="EFM32ZG210F32">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG210F32"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG210F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents/EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG210F4'  ***************************** -->
        <device Dname="EFM32ZG210F4">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG210F4"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG210F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents/EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG210F8'  ***************************** -->
        <device Dname="EFM32ZG210F8">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG210F8"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG210F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents/EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32ZG222'  **************************** -->
      <subFamily DsubFamily="EFM32ZG222">
        <feature type="IOs"           n="37"                          name="General Purpose I/O pins"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>

        <!-- *************************  Device 'EFM32ZG222F16'  ***************************** -->
        <device Dname="EFM32ZG222F16">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG222F16"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG222F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

